app/views/articles/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 5]]
---
      <strong>Author:</strong> <%= article.username %><br>
      <strong>Comments:</strong> <%= article.comments.count %><br>