app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
---
  def index
    @articles = Article.order(created_at: :desc)

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @article = Article.new(article_params)
    @article.username = current_user

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)