app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params.merge(commenter: current_user))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Bob"], ["body", "nah cali"], ["article_id", 2], ["created_at", "2024-11-02 06:41:05.266188"], ["updated_at", "2024-11-02 06:41:05.266188"]]